Repository: okffi/trello-voting
Catalog: languages/trellovoting-*.po
Languages: fi

source: Error while registering your vote
fi: Virhe rekisteröitäessä ääntäsi

source: New cards could not be fetched, please reload page
fi: Virhe haettaessa uusia ehdotuksia, ole hyvä ja lataa sivu uudelleen

source: No naughty business please
fi: Ei likaista peliä kiitos

source: Card name
fi: Ehdotus

source: Votes
fi: Ääntä

source: Read more...
fi: Lue lisää...

source: Vote this suggestion!
fi: Äänestä tätä ehdotusta!

source: Fething new cards
fi: Haetaan uusia ehdotuksia äänestettäväksi

source: I can't say, get new cards
fi: En osaa sanoa kumpi on parempi, arvo seuraava pari

source: ...or stop voting and see results
fi: ... tai lopeta äänestäminen ja näytä tulokset
